app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `wisata`
SELECT COUNT(*) AS `numrows` FROM `artikel`
---
    public function index()
    {
        $data['title'] = 'Dashboard';
        $data['current_page'] = 'dashboard';
        $data['jumlah_wisata'] = $this->wisataModel->countAll();
        $data['jumlah_artikel'] = $this->artikelModel->countAll();