app/Controllers/Admin/GambaranUmum.php

    public function index()
    {
        $gambaranUmumModel = new GambaranUmumModel();
        $gambaranUmum = $gambaranUmumModel->first();
---
SELECT *
FROM `gambaranumum`
 LIMIT 1