app/Controllers/Admin/StrukturOrganisasi.php

SELECT *
FROM `strukturorganisasi`
 LIMIT 1
---
    public function index()
    {
        $strukturOrganisasiModel = new StrukturOrganisasiModel();
        $strukturOrganisasi = $strukturOrganisasiModel->first();