app/Controllers/Admin/Wisata.php

SELECT *
FROM `wisata`
---
    public function index()
    {
        $data['title'] = 'Wisata';
        $data['current_page'] = 'wisata';
        $data['wisata'] = $this->wisataModel->findAll();

SELECT *
FROM `wisata`
WHERE `wisata`.`id_wisata` = '4'
---
    public function editwisata($id_wisata)
    {
        $data['title'] = 'Edit Wisata';
        $data['current_page'] = 'editwisata';
        $data['wisata'] = $this->wisataModel->find($id_wisata);