app/Controllers/User/Pantai.php

    public function index()
    {
        $model = new WisataModel();
        $galleryModel = new GalleryModel();

        $wisata = $model->where('nama', 'Pantai Mlarangan Asri')->first();
---
SELECT *
FROM `wisata`
WHERE `nama` = 'Pantai Mlarangan Asri'
 LIMIT 1