app/Controllers/User/Peta.php

SELECT *
FROM `wisata`
---
    public function index()
    {
        $wisataModel = new WisataModel();
        $wisataData = $wisataModel->findAll();