app/Controllers/User/Sawah.php

    public function index()
    {
        $model = new WisataModel();
        $galleryModel = new GalleryModel();

        $wisata = $model->where('nama', 'Sawah Surjan')->first();
---
SELECT *
FROM `wisata`
WHERE `nama` = 'Sawah Surjan'
 LIMIT 1