app/Models/Admin/ArtikelModel.php

    public function getArtikelOrderedByDate()
    {
        return $this->orderBy('tanggal', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC

    public function getLatestArticles($limit = 5)
    {
        return $this->orderBy('tanggal', 'DESC')->findAll($limit);
---
SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 5

    public function getArticlesWithPagination($limit, $offset)
    {
        return $this->orderBy('tanggal', 'DESC')->findAll($limit, $offset);
---
SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 6

    public function getTotalArticles()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`