app/Models/Admin/GalleryModel.php

    public function getPhotosByWisata($id_wisata, $limit = 8)
    {
        return $this->where('id_wisata', $id_wisata)
            ->orderBy('id_gallery', 'DESC')
            ->findAll($limit);
---
SELECT *
FROM `gallery`
WHERE `id_wisata` = '1'
ORDER BY `id_gallery` DESC
 LIMIT 8