app/Models/Admin/StrukturOrganisasiModel.php

    public function getStrukturOrganisasi()
    {
        return $this->first();
---
SELECT *
FROM `strukturorganisasi`
 LIMIT 1