app/Models/Admin/VisiMisiModel.php

    public function getVisiMisi()
    {
        return $this->first();
---
SELECT *
FROM `visimisi`
 LIMIT 1