app/Models/Admin/WisataModel.php

    public function getWisataByName($nama)
    {
        return $this->where('nama', $nama)->first();
---
SELECT *
FROM `wisata`
WHERE `nama` = 'Pantai Mlarangan Asri'
 LIMIT 1